'''
Написати функцію < bank > , яка працює за наступною логікою:
користувач робить вклад у розмірі < a > одиниць строком на < years > років під < percents > відсотків
(кожен рік сума вкладу збільшується на цей відсоток,
ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки).
Параметр < percents > є не обов'язковим і має значення по замовчуванню < 10 > (10%).
Функція повинна принтануть і вернуть суму, яка буде на рахунку.
'''

def bank(a, years):
    for year in range(years):
        a *= 1.1
        a = float('{:.3f}'.format(a))
    return a
print(bank(1000, 5))